{
  "footer": {
    "text": "| Lucie Jagošová EN"
  },
  "navbar": {
    "home": "Home",
    "skills": "Skills",
    "portfolio": "Projects",
    "career": "Carreer",
    "contact": "Contact"
  },
  "home_page": {
    "h1_text": "Hello, I'm Lucie",
    "hero_text_1": "front-end",
    "hero_text_2": "developer",
    "dots": "link to"
  },
  "skills_page": {
    "loading": "loading..."
  },
  "contact_page": {
    "hero_text": "If you’re interested in my work, you can contact me using the links below:",
    "linkedin": "LinkedIn",
    "email": "E-mail",
    "github": "GitHub"
  },
  "career_page": {
    "timeline": {
      "description_label": "Job description",
      "technologies_label": "Technology",
      "job1": {
        "title": "junior front-end developer",
        "company": "royal fox",
        "period": "11 2023 – 02 2024",
        "description": "I contributed to the development of a web application with a focus on UI implementation and styling using Bootstrap. I created and managed both internal and client websites in Webflow. I performed manual testing, including bug identification and reporting. Later, I also took on part of the project management responsibilities, such as sprint planning, task assignment, and overseeing task completion.",
        "technologies": "Javascript, Bootstrap, GitHub, Webflow"
      },
      "job2": {
        "title": "react typescript developer",
        "company": "urc systems",
        "period": "04 2025 – 09 2025",
        "description": "I contributed to the development of the front-end interface for security systems in the military sector. I developed new features using React and TypeScript and created UI components with Material UI.",
        "technologies": "React, Redux, Typescript, Material UI"
      }
    }
  },
  "portfolio_page": {
    "project1": {
      "project_name": "Sestav HB",
      "project_description": "A presentation website for the construction company SESTAV HB s.r.o., built in React with a project gallery using library PhotoSwipe. The site also includes domain management, hosting, and SEO optimization."
    },
    "project2": {
      "project_name": "Cashflow tracker",
      "project_description": "This is an app that allows you to record income and expenses, filter, edit, delete them and more. Data is stored and managed using Firebase database."
    },
    "project3": {
      "project_name": "Weather app",
      "project_description": "An application for displaying current weather, built in React and styled in CSS. The homepage shows weather for five main cities with the option to switch meteorological parameters. On the second page you can enter any location in the world and get current data via API."
    }
  }
}
