{
  "footer": {
    "text": "| Lucie Jagošová"
  },
  "navbar": {
    "home": "Home",
    "skills": "Skills",
    "portfolio": "Projects",
    "career": "Carreer",
    "contact": "Contact"
  },
  "home_page": {
    "h1_text": "Hello, I'm Lucie",
    "hero_text_1": "front-end",
    "hero_text_2": "developer",
    "dots": "link to"
  },
  "skills_page": {
    "loading": "loading..."
  },
  "contact_page": {
    "hero_text": "If you’re interested in my work, you can contact me using the links below:",
    "linkedin": "LinkedIn",
    "email": "E-mail",
    "github": "GitHub"
  },
  "career_page": {
    "timeline": {
      "description_label": "Job description",
      "technologies_label": "Technology",
      "job1": {
        "title": "junior front-end developer",
        "company": "royal fox",
        "period": "11 2023 – 02 2024",
        "description": "I contributed to the development of a web application with a focus on UI implementation and styling using Bootstrap. I created and managed both internal and client websites in Webflow. I performed manual testing, including bug identification and reporting. Later, I also took on part of the project management responsibilities, such as sprint planning, task assignment, and overseeing task completion.",
        "technologies": "Javascript, Bootstrap, GitHub, Webflow"
      },
      "job2": {
        "title": "react typescript developer",
        "company": "urc systems",
        "period": "04 2025 – 09 2025",
        "description": "I contributed to the development of the front-end interface for security systems in the military sector. I developed new features using React and TypeScript and created components with Material UI.",
        "technologies": "React, Redux, Typescript, Material UI"
      }
    }
  },
  "portfolio_page": {
    "project1": {
      "project_name": "Sestav HB",
      "project_description": "A presentation website for the construction company SESTAV HB s.r.o., featuring a project gallery built with the PhotoSwipe library. The project also included domain management, hosting, and SEO optimization."
    },
    "project2": {
      "project_name": "Cashflow tracker",
      "project_description": "The application allows users to record income and expenses, filter, edit, delete, and manage them using various features. All data is stored and handled through a Firebase database."
    },
    "project3": {
      "project_name": "Weather app",
      "project_description": "A weather application that displays current conditions. The homepage shows weather data for five major cities, and a second page allows users to enter any location worldwide and retrieve real-time information via an API."
    }
  },
  "error_page": {
    "error_text": "This corner of the website is empty."
  }
}
